function cal() {
    var v1 = Number(document.getElementById("v1").value); // 難易度
    var v2 = Number(document.getElementById("v2").value); // モンスター
    var v3 = Number(document.getElementById("v3").value); // パーティーメンバー
    var v4 = Number(document.getElementById("v4").value); // 人数

    var res1; //アルバンの合計

    res1 = v1 + v2 + v3 + v4;

    document.getElementById("res1").value = res1;

    var res2; //等級

    if (res1 < 70) { res2 = "C" }
    else if (res1 < 100) { res2 = "B" }
    else if (res1 < 130) { res2 = "A" }
    else if (res1 < 190) { res2 = "S" }
    else { res2 = "SS" }

    document.getElementById("res2").value = res2;


    var res3; // A達成



    if (res1 < 100 && (100 - res1) <= 10 && v2 == 0 && v3 != 0) { res3 = "モンスター（生命力150%～500%、ダメージ150%～500%、出現数150%～200%、保護/防御110%～150%、知力/幸運120%～200%）" }
    else if (res1 < 100 && (100 - res1) <= 15 && v2 == 0 && v3 != 0) { res3 = "モンスター（防御/保護120%～150%、ダメージ/生命力300%～500%、出現数150%～200%、知力/幸運150%～200%）" }
    else if (res1 < 100 && (100 - res1) <= 20 && v2 == 0 && v3 != 0) { res3 = "モンスター（防御/保護120%～150%、ダメージ/生命力300～500%、出現数150～200%、知力/幸運200%）" }
    else if (res1 < 100 && (100 - res1) <= 25 && v2 == 0 && v3 != 0) { res3 = "モンスター（防護/防御150%、ダメージ/生命力300%～500%、出現数200%）" }
    else if (res1 < 100 && (100 - res1) <= 30 && v2 == 0 && v3 != 0) { res3 = "モンスター（保護150%、ダメージ/生命力300%～500%、出現数200%）" }
    else if (res1 < 100 && (100 - res1) <= 40 && v2 == 0 && v3 != 0) { res3 = "モンスター（出現数200%、生命力/ダメージ500%）" }
    else if (res1 < 100 && (100 - res1) <= 45 && v2 == 0 && v3 != 0) { res3 = "モンスター（生命力/ダメージ500%）" }

    else if (res1 < 100 && (100 - res1) <= 10 && v2 != 0 && v3 == 0) { res3 = "パーティーメンバー（生命/マナ/スタミナ回復速度50%～70%、魔法/弓術速度50%～70%、近接ダメージ/生命力/クリティカル確率50%～70%、最大ダメージ70%）" }
    // else if (res1 < 100 && (100 - res1) <= 15 && v2 != 0 && v3 == 0) { res3 = "パーティーメンバー（生命/マナ/スタミナ回復速度50%、魔法/弓術速度50%、近接ダメージ/生命力/クリティカル確率50%、最大ダメージ50%～70%）" }
    else if (res1 < 100 && (100 - res1) <= 20 && v2 != 0 && v3 == 0) { res3 = "パーティーメンバー（生命/マナ/スタミナ回復速度50%、魔法/弓術速度50%、近接ダメージ/生命力/クリティカル確率50%、最大ダメージ50%～70%）" }
    else if (res1 < 100 && (100 - res1) <= 30 && v2 != 0 && v3 == 0) { res3 = "パーティーメンバー（生命力50%、最大ダメージ50%）" }
    else if (res1 < 100 && (100 - res1) <= 45 && v2 != 0 && v3 == 0) { res3 = "パーティーメンバー（最大ダメージ50%）" }


    else if (res1 < 100 && (100 - res1) <= 55 && v2 == 0 && v3 == 0) { res3 = "モンスター（生命力150%～500%、ダメージ150%～500%、出現数150%～200%、保護/防御110%～150%、知力/幸運120%～200%） " }
    else if (res1 < 100 && (100 - res1) <= 60 && v2 == 0 && v3 == 0) { res3 = "モンスター（防御/保護120%～150%、ダメージ/生命力300%～500%、出現数150%～200%、知力/幸運150%～200%） " }
    else if (res1 < 100 && (100 - res1) <= 65 && v2 == 0 && v3 == 0) { res3 = "モンスター（防御/保護120%～150%、ダメージ/生命力300～500%、出現数150～200%、知力/幸運200%） " }
    else if (res1 < 100 && (100 - res1) <= 70 && v2 == 0 && v3 == 0) { res3 = "モンスター（保護150%、ダメージ/生命力300%～500%、出現数200%） " }
    else if (res1 < 100 && (100 - res1) <= 85 && v2 == 0 && v3 == 0) { res3 = "モンスター（出現数200%、生命力/ダメージ500%）" }
    else if (res1 < 100 && (100 - res1) <= 90 && v2 == 0 && v3 == 0) { res3 = "モンスター（生命力/ダメージ500%）" }




    else { res3 = "達成できないか次のレベルへ移行します" }


    document.getElementById("res3").value = res3;


    var res3_1; // A達成
    if (res1 < 100 && (100 - res1) <= 55 && v2 == 0 && v3 == 0) { res3_1 = " パーティーメンバー（生命/マナ/スタミナ回復速度50%～70%、魔法/弓術速度50%～70%、近接ダメージ/生命力/クリティカル確率50%～70%、最大ダメージ70%）" }
    else if (res1 < 100 && (100 - res1) <= 60 && v2 == 0 && v3 == 0) { res3_1 = " パーティーメンバー（生命/マナ/スタミナ回復速度50%、魔法/弓術速度50%、近接ダメージ/生命力/クリティカル確率50%、最大ダメージ50%～70%） " }
    else if (res1 < 100 && (100 - res1) <= 65 && v2 == 0 && v3 == 0) { res3_1 = " パーティーメンバー（生命/マナ/スタミナ回復速度50%、魔法/弓術速度50%、近接ダメージ/生命力/クリティカル確率50%、最大ダメージ50%～70%）" }
    else if (res1 < 100 && (100 - res1) <= 70 && v2 == 0 && v3 == 0) { res3_1 = " パーティーメンバー（生命力50%、最大ダメージ50%）" }
    // else if (res1 < 100 && (100 - res1) <= 85 && v2 == 0 && v3 == 0) { res3_1 = " パーティーメンバー（最大ダメージ50%）" }
    else if (res1 < 100 && (100 - res1) <= 90 && v2 == 0 && v3 == 0) { res3_1 = " パーティーメンバー（最大ダメージ50%）" }

    else { res3_1 = "" }

    document.getElementById("res3_1").value = res3_1;



    var res4; // S達成

    if (res1 < 130 && (130 - res1) <= 10 && v2 == 0 && v3 != 0) { res4 = "モンスター（生命力150%～500%、ダメージ150%～500%、出現数150%～200%、保護/防御110%～150%、知力/幸運120%～200%）" }
    else if (res1 < 130 && (130 - res1) <= 15 && v2 == 0 && v3 != 0) { res4 = "モンスター（防御/保護120%～150%、ダメージ/生命力300%～500%、出現数150%～200%、知力/幸運150%～200%）" }
    else if (res1 < 130 && (130 - res1) <= 20 && v2 == 0 && v3 != 0) { res4 = "モンスター（防御/保護120%～150%、ダメージ/生命力300～500%、出現数150～200%、知力/幸運200%）" }
    else if (res1 < 130 && (130 - res1) <= 25 && v2 == 0 && v3 != 0) { res4 = "モンスター（防護/防御150%、ダメージ/生命力300%～500%、出現数200%）" }
    else if (res1 < 130 && (130 - res1) <= 30 && v2 == 0 && v3 != 0) { res4 = "モンスター（保護150%、ダメージ/生命力300%～500%、出現数200%）" }
    else if (res1 < 130 && (130 - res1) <= 40 && v2 == 0 && v3 != 0) { res4 = "モンスター（出現数200%、生命力/ダメージ500%）" }
    else if (res1 < 130 && (130 - res1) <= 45 && v2 == 0 && v3 != 0) { res4 = "モンスター（生命力/ダメージ500%）" }

    else if (res1 < 130 && (130 - res1) <= 10 && v2 != 0 && v3 == 0) { res4 = "パーティーメンバー（生命/マナ/スタミナ回復速度50%～70%、魔法/弓術速度50%～70%、近接ダメージ/生命力/クリティカル確率50%～70%、最大ダメージ70%）" }
    // else if (res1 < 130 && (130 - res1) <= 15 && v2 != 0 && v3 == 0) { res4 = "パーティーメンバー（生命/マナ/スタミナ回復速度50%、魔法/弓術速度50%、近接ダメージ/生命力/クリティカル確率50%、最大ダメージ50%～70%）" }
    else if (res1 < 130 && (130 - res1) <= 20 && v2 != 0 && v3 == 0) { res4 = "パーティーメンバー（生命/マナ/スタミナ回復速度50%、魔法/弓術速度50%、近接ダメージ/生命力/クリティカル確率50%、最大ダメージ50%～70%）" }
    else if (res1 < 130 && (130 - res1) <= 30 && v2 != 0 && v3 == 0) { res4 = "パーティーメンバー（生命力50%、最大ダメージ50%）" }
    else if (res1 < 130 && (130 - res1) <= 45 && v2 != 0 && v3 == 0) { res4 = "パーティーメンバー（最大ダメージ50%）" }



    else if (res1 < 130 && (130 - res1) <= 55 && v2 == 0 && v3 == 0) { res4 = "モンスター（生命力150%～500%、ダメージ150%～500%、出現数150%～200%、保護/防御110%～150%、知力/幸運120%～200%） " }
    else if (res1 < 130 && (130 - res1) <= 60 && v2 == 0 && v3 == 0) { res4 = "モンスター（防御/保護120%～150%、ダメージ/生命力300%～500%、出現数150%～200%、知力/幸運150%～200%） " }
    else if (res1 < 130 && (130 - res1) <= 65 && v2 == 0 && v3 == 0) { res4 = "モンスター（防御/保護120%～150%、ダメージ/生命力300～500%、出現数150～200%、知力/幸運200%） " }
    else if (res1 < 130 && (130 - res1) <= 70 && v2 == 0 && v3 == 0) { res4 = "モンスター（保護150%、ダメージ/生命力300%～500%、出現数200%） " }
    else if (res1 < 130 && (130 - res1) <= 85 && v2 == 0 && v3 == 0) { res4 = "モンスター（出現数200%、生命力/ダメージ500%） " }
    else if (res1 < 130 && (130 - res1) <= 90 && v2 == 0 && v3 == 0) { res4 = "モンスター（生命力/ダメージ500%）" }

    else { res4 = "達成できないか次のレベルへ移行します" }


    document.getElementById("res4").value = res4;



    var res4_1; // S達成
    if (res1 < 130 && (130 - res1) <= 55 && v2 == 0 && v3 == 0) { res4_1 = " パーティーメンバー（生命/マナ/スタミナ回復速度50%～70%、魔法/弓術速度50%～70%、近接ダメージ/生命力/クリティカル確率50%～70%、最大ダメージ70%）" }
    else if (res1 < 130 && (130 - res1) <= 60 && v2 == 0 && v3 == 0) { res4_1 = " パーティーメンバー（生命/マナ/スタミナ回復速度50%、魔法/弓術速度50%、近接ダメージ/生命力/クリティカル確率50%、最大ダメージ50%～70%） " }
    else if (res1 < 130 && (130 - res1) <= 65 && v2 == 0 && v3 == 0) { res4_1 = " パーティーメンバー（生命/マナ/スタミナ回復速度50%、魔法/弓術速度50%、近接ダメージ/生命力/クリティカル確率50%、最大ダメージ50%～70%）" }
    else if (res1 < 130 && (130 - res1) <= 70 && v2 == 0 && v3 == 0) { res4_1 = " パーティーメンバー（生命力50%、最大ダメージ50%）" }
    // else if (res1 < 130 && (130 - res1) <= 85 && v2 == 0 && v3 == 0) { res4_1 = " パーティーメンバー（最大ダメージ50%）" }
    else if (res1 < 130 && (130 - res1) <= 90 && v2 == 0 && v3 == 0) { res4_1 = " パーティーメンバー（最大ダメージ50%）" }

    else { res4_1 = "" }

    document.getElementById("res4_1").value = res4_1;



    var res5; // SS達成

    if (res1 < 190 && (190 - res1) <= 10 && v2 == 0 && v3 != 0) { res5 = "モンスター（生命力150%～500%、ダメージ150%～500%、出現数150%～200%、保護/防御110%～150%、知力/幸運120%～200%）" }
    else if (res1 < 190 && (190 - res1) <= 15 && v2 == 0 && v3 != 0) { res5 = "モンスター（防御/保護120%～150%、ダメージ/生命力300%～500%、出現数150%～200%、知力/幸運150%～200%）" }
    else if (res1 < 190 && (190 - res1) <= 20 && v2 == 0 && v3 != 0) { res5 = "モンスター（防御/保護120%～150%、ダメージ/生命力300～500%、出現数150～200%、知力/幸運200%）" }
    else if (res1 < 190 && (190 - res1) <= 25 && v2 == 0 && v3 != 0) { res5 = "モンスター（防護/防御150%、ダメージ/生命力300%～500%、出現数200%）" }
    else if (res1 < 190 && (190 - res1) <= 30 && v2 == 0 && v3 != 0) { res5 = "モンスター（保護150%、ダメージ/生命力300%～500%、出現数200%）" }
    else if (res1 < 190 && (190 - res1) <= 40 && v2 == 0 && v3 != 0) { res5 = "モンスター（出現数200%、生命力/ダメージ500%）" }
    else if (res1 < 190 && (190 - res1) <= 45 && v2 == 0 && v3 != 0) { res5 = "モンスター（生命力/ダメージ500%）" }

    else if (res1 < 190 && (190 - res1) <= 10 && v2 != 0 && v3 == 0) { res5 = "パーティーメンバー（生命/マナ/スタミナ回復速度50%～70%、魔法/弓術速度50%～70%、近接ダメージ/生命力/クリティカル確率50%～70%、最大ダメージ50～70%）" }
    // else if (res1 < 190 && (190 - res1) <= 15 && v2 != 0 && v3 == 0) { res5 = "パーティーメンバー（生命/マナ/スタミナ回復速度50%、魔法/弓術速度50%、近接ダメージ/生命力/クリティカル確率50%、最大ダメージ50%～70%）" }
    else if (res1 < 190 && (190 - res1) <= 20 && v2 != 0 && v3 == 0) { res5 = "パーティーメンバー（生命/マナ/スタミナ回復速度50%、魔法/弓術速度50%、近接ダメージ/生命力/クリティカル確率50%、最大ダメージ50%～70%）" }
    else if (res1 < 190 && (190 - res1) <= 30 && v2 != 0 && v3 == 0) { res5 = "パーティーメンバー（生命力50%、最大ダメージ50%）" }
    else if (res1 < 190 && (190 - res1) <= 45 && v2 != 0 && v3 == 0) { res5 = "パーティーメンバー（最大ダメージ50%）" }


    else if (res1 < 190 && (190 - res1) <= 55 && v2 == 0 && v3 == 0) { res5 = "モンスター（生命力150%～500%、ダメージ150%～500%、出現数150%～200%、保護/防御110%～150%、知力/幸運120%～200%） " }
    else if (res1 < 190 && (190 - res1) <= 60 && v2 == 0 && v3 == 0) { res5 = "モンスター（防御/保護120%～150%、ダメージ/生命力300%～500%、出現数150%～200%、知力/幸運150%～200%） " }
    else if (res1 < 190 && (190 - res1) <= 65 && v2 == 0 && v3 == 0) { res5 = "モンスター（防御/保護120%～150%、ダメージ/生命力300～500%、出現数150～200%、知力/幸運200%） " }
    else if (res1 < 190 && (190 - res1) <= 70 && v2 == 0 && v3 == 0) { res5 = "モンスター（保護150%、ダメージ/生命力300%～500%、出現数200%） " }
    else if (res1 < 190 && (190 - res1) <= 85 && v2 == 0 && v3 == 0) { res5 = "モンスター（出現数200%、生命力/ダメージ500%） " }
    else if (res1 < 190 && (190 - res1) <= 90 && v2 == 0 && v3 == 0) { res5 = "モンスター（生命力/ダメージ500%）" }

    else { res5 = "達成できないか次のレベルへ移行します" }


    document.getElementById("res5").value = res5;


    var res5_1; // SS達成
    if (res1 < 190 && (190 - res1) <= 55 && v2 == 0 && v3 == 0) { res5_1 = " パーティーメンバー（生命/マナ/スタミナ回復速度50%～70%、魔法/弓術速度50%～70%、近接ダメージ/生命力/クリティカル確率50%～70%、最大ダメージ70%）" }
    else if (res1 < 190 && (190 - res1) <= 60 && v2 == 0 && v3 == 0) { res5_1 = " パーティーメンバー（生命/マナ/スタミナ回復速度50%、魔法/弓術速度50%、近接ダメージ/生命力/クリティカル確率50%、最大ダメージ50%～70%） " }
    else if (res1 < 190 && (190 - res1) <= 65 && v2 == 0 && v3 == 0) { res5_1 = " パーティーメンバー（生命/マナ/スタミナ回復速度50%、魔法/弓術速度50%、近接ダメージ/生命力/クリティカル確率50%、最大ダメージ50%～70%）" }
    else if (res1 < 190 && (190 - res1) <= 70 && v2 == 0 && v3 == 0) { res5_1 = " パーティーメンバー（生命力50%、最大ダメージ50%）" }
    // else if (res1 < 190 && (190 - res1) <= 85 && v2 == 0 && v3 == 0) { res5_1 = " パーティーメンバー（最大ダメージ50%）" }
    else if (res1 < 190 && (190 - res1) <= 90 && v2 == 0 && v3 == 0) { res5_1 = " パーティーメンバー（最大ダメージ50%）" }

    else { res5_1 = "" }

    document.getElementById("res5_1").value = res5_1;

}

function fetchData(selectId) {
    const selectElement = document.getElementById(selectId);
    const selectedOption = selectElement.options[selectElement.selectedIndex];
    const selectedItem = selectedOption.getAttribute("data-label") || selectedOption.value;
    const MABINOGI_KEY = 'MABINOGI_API_KEY';


    if (!selectedItem || selectedItem === "0") {
        console.error("アイテムが選択されていません。");
        document.getElementById(selectId + "-price").textContent = "- G";
        return;
    }

    const fullItemName = `알반 기사단의 훈련석 ${selectedItem}`;
    const encodedItemName = encodeURIComponent(fullItemName);
    console.log(`Fetching data for ${selectId}:`, fullItemName, "Encoded:", encodedItemName);
    
    fetch(`https://open.api.nexon.com/mabinogi/v1/auction/list?auction_item_category=%EC%95%8C%EB%B0%98%20%ED%9B%88%EB%A0%A8%EC%84%9D&item_name=${encodedItemName}`, {
        headers: {'x-nxopen-api-key':MABINOGI_KEY}
    })
    .then(response => response.json())
    .then(data => {
        console.log(`Received data for ${selectId}:`, data);
        if (data.auction_item && data.auction_item.length > 0) {
            let lowestPrice = Math.min(...data.auction_item.map(item => item.auction_price_per_unit));
            document.getElementById(selectId + "-price").textContent = lowestPrice.toLocaleString() + " G";
        } else {
            document.getElementById(selectId + "-price").textContent = "- G";
        }
    })
    .catch(error => console.error("データを読み込む際にエラーが発生しました:", error));
}
